WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    if ((host_name != NULL) && (strlen(host_name) <= HOST_NAME_MAX) && (strlen(host_name) > 0) && isalpha(host_name[0]))
    {
        for (const char *ch = host_name; *ch != 0; ch++)
        {
            if (!(isalnum(*ch) || (*ch == '-') || (*ch == '_')))
            {
                result = 0;
                break;
            }
        }
    }
    else
    {
        result = 0;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_value
 *
 * Description:
 *  Set a value on the ESP32.
 *
 *  This method will block until the ESP32 confirms that the value has been
 *  set correctly.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - pointer to the value to be set.
 *  value_size - size of the value.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_value(espcp_configuration_items_t item, uint8_t *value, uint32_t value_size)
{
    espcp_configuration_value_t item_value = { };

    item_value.value = malloc(value_size);
    if (item_value.value == NULL)
    {
        return ERROR;
    }
    memcpy(item_value.value, value, value_size);
    item_value.item = item;
    item_value.value_length = value_size;
    int payload_length = espcp_configuration_value_buffer_size(&item_value);
    uint8_t *payload = malloc(payload_length);
    if (payload == NULL)
    {
        free(item_value.value);
        return(ERROR);
    }
    espcp_encode_configuration_value(&item_value, payload);
    free(item_value.value);
    espcp_message_t *message = espcp_create_message_on_heap(espcp_message_types_header, espcp_esp32_interfaces_system,
                                                            espcp_system_function_set_configuration_item, espcp_status_codes_completed_ok,
                                                            espcp_get_next_message_id(), payload, payload_length);
    if (message == NULL)
    {
        free(payload);
        return(ERROR);
    }

    int result = ERROR;
    if (espcp_queue_message(message, true) == espcp_status_codes_completed_ok)
    {
        if (message->status_code == espcp_status_codes_completed_ok)
        {
            result = OK;
        }
    }
    espcp_delete_message_and_payload(message);
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_integer_value
 *
 * Description:
 *  Set an integer value on the ESP32.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_integer_value(espcp_configuration_items_t item, uint32_t value)
{
    return(hcom_nx_config_set_esp_value(item, (uint8_t *) &value, 4));
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_boolean_value
 *
 * Description:
 *  Set a boolean value on the ESP32.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_t item, uint8_t value)
{
    return(hcom_nx_config_set_esp_value(item, (uint8_t *) &value, 1));
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_string_value
 *
 * Description:
 *  Set the a string configuration value on the ESP32.
 *
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_string_value(espcp_configuration_items_t item, const char *value)
{
    int result;

    if (value != NULL)
    {
        result = hcom_nx_config_set_esp_value(item, (uint8_t *) value, strlen(value) + 1);
    }
    else
    {
        result = ERROR;
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_host_name
 *
 * Description:
 *  Set the device name.
 *
 *  If the device name is invalid then set the device name to the default
 *  value (MeadowF7).
 *
 * Input Parameters:
 *  config - pointer to the configuration structure.
 *  device_name - New name for the device.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_set_host_name(meadow_configuration_t *config, const char *device_name)
{
    char *new_name = NULL;
    if (!hcom_nx_config_is_valid_host_name(device_name))
    {
        new_name = strdup(MEADOW_CONFIG_DEFAULT_DEVICE_NAME);
    }
    else
    {
        new_name = strdup(device_name);
    }
    if (config->device_name != NULL)
    {
        kmm_free(config->device_name);
    }
    config->device_name = new_name;
    sethostname(config->device_name, strlen(config->device_name));
}

/****************************************************************************
 * Name: hcom_nx_config_set_device_name
 *
 * Description:
 *  Set the device name.
 *
 *  If the device name is invalid then set the device name to the default
 *  value (MeadowF7).
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the NTP server name
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_set_device_name(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer[buffer_length] == 0)
    {
        result = hcom_nx_config_set_esp_string_value(espcp_configuration_items_device_name, (char *) buffer);
        if (result == OK)
        {
            if (config->device_name != NULL)
            {
                kmm_free(config->device_name);
            }
            config->device_name = strdup((char *) buffer);
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_which_boolean
 *
 * Description:
 *  Take the value from the configuration file and work out if a value is
 *  present in the file and if it is, is it valid or should a default be used.
 *
 * Input Parameters:
 *  config_value - pointer to a string in the config file.
 *  which - pointer to the enum indicating if the config file value or the
 *          value stored in the ESP should be used.
 *  value - pointer to the storage space for the uint8_t value.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 ****************************************************************************/
static void hcom_nx_config_which_boolean(const char *config_value, which_config_value_t *which, uint8_t *value)
{
    if (config_value == NULL)
    {
        *which = use_esp_config_value;
        *value = 0;
    }
    else
    {
        char *lowercase = malloc(strlen(config_value) + 1);
        for (int index = 0; index < strlen(config_value); index++)
        {
            lowercase[index] = config_value[index];
        }
        lowercase[strlen(config_value)] = 0;
        if ((strcmp(lowercase, "true") == 0) || (strcmp(lowercase, "yes") == 0) || (config_value[0] == '1'))
        {
            *which = use_config_file_value;
            *value = 1;
        }
        else
        {
            if ((strcmp(lowercase, "false") == 0) || (strcmp(lowercase, "no") == 0) || (config_value[0] == '0'))
            {
                *which = use_config_file_value;
                *value = 0;
            }
            else
            {
                *which = use_esp_config_value;
                *value = 0;
            }
        }
        free(lowercase);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_which_unsigned_integer
 *
 * Description:
 *  Take the value from the configuration file and work out if a value is
 *  present in the file and if it is, is it valid or should a default be used.
 *
 * Input Parameters:
 *  config_value - pointer to a string in the config file.
 *  which - pointer to the enum indicating if the config file value or the
 *          value stored in the ESP should be used.
 *  value - pointer to the storage space for the uint32_t value.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 ****************************************************************************/
static void hcom_nx_config_which_unsigned_integer(const char *config_value, which_config_value_t *which, uint32_t *value)
{
    if (config_value == NULL)
    {
        *which = use_esp_config_value;
        *value = 0;
    }
    else
    {
        if (strspn(config_value, "0123456789") == strlen(config_value))
        {
            long l = atol(config_value);
            if (l <= UINT32_MAX)
            {
                *which = use_config_file_value;
                *value = (uint32_t) (l & 0xffffffff);
            }
            else
            {
                *which = use_esp_config_value;
                *value = 0;
            }
        }
    }
}

/****************************************************************************
 * Name: hcom_nx_config_read_file
 *
 * Description:
 *  Read the current configuration from flash and populate the configuration
 *  object.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *  Pointer to the newly populated configuration object or NULL if there was
 *  a problem.
 *
 * Assumptions/Limitations:
 *  This method is only allowed to be called once to read the configuration
 *  at startup.  Duplicate calls to this method simply return the current
 *  value of the meadow_configuration pointer and take no other action.
 *
 ****************************************************************************/
static meadow_configuration_t *hcom_nx_config_read_file(void)
{
    hcom_nx_config_lock();
    if (meadow_configuration == NULL)
    {
        meadow_configuration = (meadow_configuration_t *) malloc(sizeof(meadow_configuration_t));
        if (meadow_configuration != NULL)
        {
        	yaml_configuration_t *configuration;

            memset(meadow_configuration, 0, sizeof(meadow_configuration_t));
            cyaml_err_t err = cyaml_load_file(MEADOW_CONFIG_DEFAULT_FILE_NAME, &cyaml_config, &configuration_schema, (void **) &configuration, NULL);
            if (err != CYAML_OK)
            {
                meadow_configuration->using_default_configuration = 1;
                meadow_configuration->reset_esp32_at_startup = 1;
                meadow_configuration->esp_spi_speed = 8000000;
                meadow_configuration->maximum_retry_count = 3;
            }
            else
            {
                meadow_configuration->using_default_configuration = 0;
                if (configuration->mono_control != NULL)
                {
                    meadow_configuration->disable_mono = configuration->mono_control->disable;
                    meadow_configuration->mono_options = strdup(configuration->mono_control->options);
                }
                //
                if (configuration->coprocessor != NULL)
                {
                    meadow_configuration->reset_esp32_at_startup = !configuration->coprocessor->debugger_attached;
                    meadow_configuration->esp_spi_speed = (configuration->coprocessor->spi_speed < 100000) ? 100000 : configuration->coprocessor->spi_speed;
                    hcom_nx_config_which_boolean(configuration->coprocessor->automatically_reconnect, &meadow_configuration->which_automatically_reconnect, &meadow_configuration->automatically_reconnect);
                    hcom_nx_config_which_boolean(configuration->coprocessor->automatically_start_network, &meadow_configuration->which_automatically_start_network, &meadow_configuration->automatically_start_network);
                    hcom_nx_config_which_unsigned_integer(configuration->coprocessor->maximum_retry_count, &meadow_configuration->which_maximum_retry_count, &meadow_configuration->maximum_retry_count);
                }
                else
                {
                    meadow_configuration->reset_esp32_at_startup = 1;
                    meadow_configuration->esp_spi_speed = 8000000;
                }
                if (configuration->network != NULL)
                {
                    hcom_nx_config_which_boolean(configuration->network->get_network_time_at_startup, &meadow_configuration->which_get_network_time_at_startup, &meadow_configuration->get_network_time_at_startup);
                    if (configuration->network->ntp_server != NULL)
                    {
                        meadow_configuration->ntp_server = strdup(configuration->network->ntp_server);
                    }
                }
                if (configuration->debug != NULL)
                {
                    meadow_configuration->trace_level = configuration->debug->trace_level;
                    meadow_configuration->use_uart1_for_trace = (strcmp(configuration->debug->uart1_use, "trace") == 0);
                }
                //
                if (configuration->device != NULL)
                {
                    if (configuration->device->name != NULL)
                    {
                        meadow_configuration->device_name = strdup(configuration->device->name);
                    }
                    else
                    {
                        meadow_configuration->device_name = strdup(MEADOW_CONFIG_DEFAULT_DEVICE_NAME);
                    }
                }
                //
                meadow_configuration->esp_software_version = NULL;

                cyaml_free(&cyaml_config, &configuration_schema, configuration, 0);
            }
        }
    }

    hcom_nx_config_unlock();
    return(meadow_configuration);
}

/****************************************************************************
 * Name: hcom_nx_config_copy_string
 *
 * Description:
 *  Copy a string into the buffer and return the amount of storage used to
 *  store the string and its terminating 0.
 *
 * Input Parameters:
 *  source - String to be copied.
 *  destination - Memory to hold the copy of the string.
 *
 * Returned Value:
 *  Amount of memory consumed by the string and its terminating 0.
 *
 * Assumptions/Limitations:
 *  The destination buffer is large enough to hold tha copy of the string.
 *
 ****************************************************************************/
int hcom_nx_config_copy_string(char *source, char *destination)
{
    int length = 0;

    if (source == NULL)
    {
        *destination = 0;
    }
    else
    {
        length = strlen(source);
        strcpy(destination, source);
    }

