WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    if (buffer_length > 16)
    {
        result = snprintf((char *) buffer, buffer_length, "%d.%d.%d.%d", (config->mono_version >> 24) & 0xff, (config->mono_version >> 16) & 0xff,
                            (config->mono_version >> 8) & 0xff, config->mono_version & 0xff);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_automatically_connect_to_network
 *
 * Description:
 *  Get the AutomaticallyConnectToNetwork property from the ESP configuration.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_get_automatically_connect_to_network(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length > 0)
    {
        *buffer = config->automatically_start_network ? 1 : 0;
        result = 1;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_automatically_start_network
 *
 * Description:
 *  Set the automatically_start_network property and inform the ESP of the
 *  change.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_automatically_start_network(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 1)
    {
        result = hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_start_network, *buffer);
        if (result == OK)
        {
            config->automatically_start_network = *buffer;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_automatically_reconnect
 *
 * Description:
 *  Get the AutomaticallyReconnect property from the ESP configuration.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_get_automatically_reconnect(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length > 0)
    {
        *buffer = config->automatically_reconnect ? 1 : 0;
        result = 1;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_automatically_reconnect
 *
 * Description:
 *  Set the AutomaticallyReconnect property and inform the ESP of the change.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_automatically_reconnect(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 1)
    {
        result = hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, *buffer);
        if (result == OK)
        {
            config->automatically_reconnect = *buffer;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_get_time_at_startup
 *
 * Description:
 *  Get the GetTimeAtStartup property from the ESP configuration.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the current value of the GetNetworkTimeAtStartup
 *           property.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_get_get_time_at_startup(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length > 0)
    {
        *buffer = config->get_network_time_at_startup ? 1 : 0;
        result = 1;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_get_time_at_startup
 *
 * Description:
 *  Set the GetTimeAtStartup property passing the new value to the ESP32.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer holding the new value for the GetNetworkTimeAtStartup
 *           property.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_get_time_at_startup(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 1)
    {
        result = hcom_nx_config_set_esp_boolean_value(cv_get_time_at_startup, *buffer);
        if (result == OK)
        {
            config->get_network_time_at_startup = *buffer;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_ntp_server
 *
 * Description:
 *  Get the address of any configured NTP server.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the NTP server name
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_ntp_server(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (config->ntp_server != NULL)
    {
        result = hcom_nx_config_get_string_value(config->ntp_server, buffer, buffer_length);
    }
    else
    {
        *buffer = 0;
        result = 0;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_ntp_server
 *
 * Description:
 *  Set the GetTimeAtStartup property passing the new value to the ESP32.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer holding the new value for the GetNetworkTimeAtStartup
 *           property.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_ntp_server(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer[buffer_length] == 0)
    {
        result = hcom_nx_config_set_esp_string_value(espcp_configuration_items_ntp_server, (char *) buffer);
        if (result == OK)
        {
            if (config->ntp_server != NULL)
            {
                kmm_free(config->ntp_server);
            }
            config->ntp_server = strdup((char *) buffer);
        }
    }
    return(result);
}
/****************************************************************************
 * Name: hcom_nx_config_get_maximum_retry_count
 *
 * Description:
 *  Get the maximum number of times a retry operation will be attempted.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the maximum retry count.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_maximum_retry_count(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    result = hcom_nx_config_get_bytes((uint8_t *) &config->maximum_retry_count, sizeof(int), buffer, buffer_length);

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_maximum_retry_count
 *
 * Description:
 *  Set the GetTimeAtStartup property passing the new value to the ESP32.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer holding the new value for the GetNetworkTimeAtStartup
 *           property.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_maximum_retry_count(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 4)
    {
        int retryCount = *((int *) buffer);
        result = hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_maximum_retry_count, retryCount);
        if (result == OK)
        {
            config->maximum_retry_count = retryCount;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hxom_nx_config_get_board_mac_address
 *
 * Description:
 *  Get the MAC address of the board (ESP32 MAC address).
 *
 * Input Parameters:
 *  buffer - Buffer to hold the MAC address
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_board_mac_address(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;
    
    result = hcom_nx_config_get_bytes(config->board_mac_address, sizeof(config->board_mac_address), buffer, buffer_length);

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_soft_ap_mac_address
 *
 * Description:
 *  Get the soft access point MAC address of the ESP32 chip.
 *
 * Input Parameters:
 *  buffer - Buffer to hold the soft access point MAC address
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_soft_ap_mac_address(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;
    
    result = hcom_nx_config_get_bytes(config->soft_ap_mac_address, sizeof(config->soft_ap_mac_address), buffer, buffer_length);

    return(result);
}


/****************************************************************************
 * Name: hcom_nx_config_get_set_config_value
 *
 * Description:
 *  Read or write a configuration value.
 *
 * Input Parameters:
 *  item - Value to be accessed.
 *  direction - Read (0) or write (1).
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_set_config_value(int item, uint8_t direction, uint8_t *buffer, int buffer_length)
{
    int result;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_config_get_pointer();
    if (direction == 0)
    {
        switch (item)
        {
            case cv_device_name:
                result = hcom_nx_config_get_string_value(config->device_name, buffer, buffer_length);
                break;
            case cv_product:
                result = hcom_nx_config_get_uint32_value(config->hardware_version, buffer, buffer_length);
                break;
            case cv_model:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_MODEL, buffer, buffer_length);
                break;
            case cv_os_version:
                result = hcom_nx_config_get_string_value(config->meadow_software_version, buffer, buffer_length);
                break;
            case cv_build_date:
                result = hcom_nx_config_get_string_value(__DATE__ " " __TIME__, buffer, buffer_length);
                break;
            case cv_processor_type:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_PROCESSOR_TYPE, buffer, buffer_length);
                break;
            case cv_unique_id:
                result = hcom_nx_config_get_unique_id(config, buffer, buffer_length);
                break;
            case cv_serial_number:
                result = hcom_nx_config_get_serial_number(config, buffer, buffer_length);
                break;
            case cv_coprocessor_type:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_COPROCESSOR_TYPE, buffer, buffer_length);
                break;
            case cv_coprocessor_firmware_version:
                result = hcom_nx_config_get_coprocessor_firmware_version(config, buffer, buffer_length);
                break;
            case cv_mono_version:
                result = hcom_nx_config_get_mono_version(config, buffer, buffer_length);
                break;
            case cv_automatically_start_network:
                result = hcom_nx_config_get_automatically_connect_to_network(config, buffer, buffer_length);
                break;
            case cv_automatically_reconnect:
                result = hcom_nx_config_get_automatically_reconnect(config, buffer, buffer_length);
                break;
            case cv_maximum_network_retry_count:
                result = hcom_nx_config_get_maximum_retry_count(config, buffer, buffer_length);
                break;
            case cv_get_time_at_startup:
                result = hcom_nx_config_get_get_time_at_startup(config, buffer, buffer_length);
                break;
            case cv_ntp_server:
                result = hcom_nx_config_get_ntp_server(config, buffer, buffer_length);
                break;
            case cv_mac_address:
                result = hcom_nx_config_get_board_mac_address(config, buffer, buffer_length);
                break;
            case cv_soft_ap_mac_address:
                result = hcom_nx_config_get_soft_ap_mac_address(config, buffer, buffer_length);
                break;
            case cv_default_access_point:
                result = hcom_nx_config_get_string_value(config->default_access_point, buffer, buffer_length);
                break;
            default:
                result = ERROR;
                break;
        }
    }
    else
    {
        switch (item)
        {
            case cv_device_name:
                result = hcom_nx_config_set_device_name(config, buffer, buffer_length);
                break;
            case cv_automatically_start_network:
                result = hcom_nx_config_set_automatically_start_network(config, buffer, buffer_length);
                break;
            case cv_automatically_reconnect:
                result = hcom_nx_config_set_automatically_reconnect(config, buffer, buffer_length);
                break;
            case cv_maximum_network_retry_count:
                result = hcom_nx_config_set_maximum_retry_count(config, buffer, buffer_length);
                break;
            case cv_get_time_at_startup:
                result = hcom_nx_config_set_get_time_at_startup(config, buffer, buffer_length);
                break;
            case cv_ntp_server:
                result = hcom_nx_config_set_ntp_server(config, buffer, buffer_length);
                break;
            default:
                result = ERROR;
                break;
        }
    }
    hcom_nx_config_unlock();
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_process_esp_configuration
 *
 * Description:
 *  Compare the incooming ESP configuration with the current configuration
 *  read from the configuration file.  The configuration file is considered
 *  to be the source of truth.
 *
 *  Send any differences over to the ESP32.
 *
 * Input Parameters:
 *  esp_config - Configuration stored in the ESP32.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_process_esp_configuration(espcp_system_configuration_t *esp_config)
{
    hcom_nx_config_lock();
    meadow_configuration_t *configuration = hcom_nx_config_get_pointer();
    if (configuration != NULL)
    {
        if (configuration->which_automatically_start_network == use_config_file_value)
        {
            if (configuration->automatically_start_network != esp_config->automatically_start_network)
            {
                hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_start_network, configuration->automatically_start_network == 1);
            }
        }
        else
        {
            configuration->automatically_start_network = esp_config->automatically_start_network;
        }
        //
        if (configuration->which_automatically_reconnect == use_config_file_value)
        {
            if (configuration->automatically_reconnect != esp_config->automatically_reconnect)
            {
                hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, configuration->automatically_reconnect == 1);
            }
        }
        else
        {
            configuration->automatically_reconnect = esp_config->automatically_reconnect;
        }
        //
        if (configuration->which_maximum_retry_count == use_config_file_value)
        {
            if (configuration->maximum_retry_count != esp_config->maximum_retry_count)
            {
                hcom_nx_config_set_esp_integer_value(espcp_configuration_items_maximum_retry_count, configuration->maximum_retry_count);
            }
        }
        else
        {
            configuration->maximum_retry_count = esp_config->maximum_retry_count;
        }
        //
        if (configuration->which_get_network_time_at_startup == use_config_file_value)
        {
            if (configuration->get_network_time_at_startup != esp_config->get_time_at_startup)
            {
                hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_get_time_at_startup, configuration->get_network_time_at_startup == 1);
            }
        }
        else
        {
            configuration->get_network_time_at_startup = esp_config->get_time_at_startup;
        }
        //
        if ((esp_config->device_name != NULL) && (strcmp(configuration->device_name, esp_config->device_name) != 0))
        {
            hcom_nx_config_set_esp_string_value(espcp_configuration_items_device_name, configuration->device_name);
        }
        //
        if (configuration->ntp_server != NULL)
        {
            if ((esp_config->ntp_server == NULL) || (strcmp(configuration->ntp_server, esp_config->ntp_server) != 0))
            {
                hcom_nx_config_set_esp_string_value(espcp_configuration_items_ntp_server, configuration->ntp_server);
            }
        }
        else
        {
            if ((esp_config->ntp_server != NULL) && (strlen(esp_config->ntp_server) != 0))
            {
                configuration->ntp_server = strdup(esp_config->ntp_server);
            }
        }
        //
        if (esp_config->default_access_point != NULL)
        {
            configuration->default_access_point = strdup(esp_config->default_access_point);
        }
        else
        {
            configuration->default_access_point = NULL;
        }
        //
        if (esp_config->software_version != NULL)
        {
            if (configuration->esp_software_version != NULL)
            {
                kmm_free(configuration->esp_software_version);
            }
            configuration->esp_software_version = strdup(esp_config->software_version);
        }
        else
        {
            configuration->esp_software_version = NULL;
        }
        //
        memcpy(configuration->board_mac_address, esp_config->board_mac_address, 6);
        memcpy(configuration->soft_ap_mac_address, esp_config->soft_ap_mac_address, 6);
    }
    hcom_nx_config_unlock();
}

/****************************************************************************
 * Name: hcom_nx_config_process_wifi_credentials_file
 *
 * Description:
 *  Check to see if a wifi.yaml file exists and send the credentials to the
 *  ESP32 if it exists and contains valid data.
 *
 *  The wifi.yaml file will be deleted as a security measure to prevent
 *  the credentials from being downloaded using the CLI tool.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_process_wifi_credentials_file(void)
{
    yaml_wifi_credentials_t *credentials;

