WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    cyaml_err_t err = cyaml_load_file(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME, &cyaml_config, &wifi_credentials_schema, (void **) &credentials, NULL);
    if (err == CYAML_OK)
    {
        if ((credentials->credentials->ssid != NULL) && (strlen(credentials->credentials->ssid) <= MAXIMUM_SSID_LENGTH) & (strlen(credentials->credentials->ssid) > 0))
        {
            char password[65] = { };
            if ((credentials->credentials->password != NULL) && (strlen(credentials->credentials->password) <= MAXIMUM_PASSWORD_LENGTH))
            {
                strcpy(password, credentials->credentials->password);
            }
            uint32_t size = strlen(credentials->credentials->ssid) + strlen(password) + 2;
            uint8_t *buffer = malloc(size);
            if (buffer != NULL)
            {
                hcom_nx_config_lock();
                meadow_configuration_t *config = hcom_nx_config_get_pointer();
                if (config->default_access_point != NULL)
                {
                    kmm_free(config->default_access_point);
                }
                config->default_access_point = strdup(credentials->credentials->ssid);
                hcom_nx_config_unlock();
                strcpy((char *) buffer, credentials->credentials->ssid);
                strcpy((char *) (buffer + strlen(credentials->credentials->ssid) + 1), password);
                hcom_nx_config_set_esp_value(espcp_configuration_items_default_ap_and_password, buffer, size);
                free(buffer);
            }
        }
        cyaml_free(&cyaml_config, &wifi_credentials_schema, credentials, 0);
    }
    //
    //  Now we can delete the file.
    //
    unlink(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME);
}

/****************************************************************************
 * Name: hcom_nx_config_init
 *
 * Description:
 *  Setup the configuration system and populate the configuration structure
 *  with data from the configuration file.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_init(void)
{
    sem_init(&config_lock, 0, 1);                   // Create the config lock.
    sem_setprotocol(&config_lock, SEM_PRIO_NONE);
    hcom_nx_config_read_file();

    uint32_t mono_version = 0;

    boardctl(BIOC_ENTER_MEMMAP, 0);

    // Check if Meadow.OS runtime is flashed at external flash.
    #define STM32_FMCBANK4_BASE  0x90000000     /* 0x90000000-0x9fffffff: FMC bank 4 */
    uint32_t signature = *((uint32_t *) STM32_FMCBANK4_BASE);
    if (signature != 0xDDCCBBAA)
    {
        syslog(LOG_ERR, "Mono runtime was not found flashed in external flash.\n");
    }
    else
    {
        mono_version = *((uint32_t *) (STM32_FMCBANK4_BASE + 4));
    }
    boardctl(BIOC_EXIT_MEMMAP, 0);

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_config_get_pointer();
    hcom_nx_config_set_host_name(config, config->device_name);
    config->hardware_version = meadow_hw_version_get();
    config->mono_version = mono_version;
    config->meadow_software_version = HCOM_DEVICE_INFO_MEADOW_OS_VERSION;
    config->meadow_hardware_version = meadow_hw_version_string_return();

    stm32_get_uniqueid(config->serial_number);                           // Convert chip Id to serial number
    config->chip_id[0] = config->serial_number[11];                      // 95-88
    config->chip_id[1] = config->serial_number[10] + config->serial_number[2];        // 87-80 + 23-16
    config->chip_id[2] = config->serial_number[9];                       // 79-72
    config->chip_id[3] = config->serial_number[8] + config->serial_number[0] + 10;    // 71-64 + 7-0 + magic 10
    config->chip_id[4] = config->serial_number[7];                       // 63-56
    config->chip_id[5] = config->serial_number[6];                       // 55-48

    hcom_nx_config_unlock();
}
